num1 = int(input("please enter your num 1"))
 



num2 = int(input("please enter your num 2"))


print(int (num1) + int(num2) )


# ფუნქციები რომლებიც ერთი მონაცემთა ტიპიდან გადაყვათ მეორეში 
# ამ შემთხვევაში int(),str() და float() ქვიათ მექანიკური მონაცემთა ტიპის შეცვლა
# მექანიკურში ვგულისხმობ იმას რომ ჩვენ ჩვენი ხელით გარდავქმნით ერთი ტიპიდან მეორეში

# int() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ინტეჯერად ანუ მთელ რიცხვად.
print(int(5.9))
print(int("5") + 5)

# float() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ათწილად რიცხვად.
print(float("5.6"))
print(float(3))

# str() ეს ფუნქცია გვეხმარება იმაში რომ ნებისმიერი მნიშვნელობა გარდავქმნათ სტრინგად.
print(str(5) + "5")
print(str(3.4) + "1")

# type() ეს ფუნქცია გვეხმარება იმაში რომ გავიგოთ კონკრეტული მნიშვნელობა რა ტიპის არის.
print(type(3.1))
print(type(5))
print(type("luka"))



#

print(int(5.9))
print(int("5") + 5)

#

print(float("5.6"))
print(float(3))

#

print(str(5) + "5")
print(str(3.4) + "1")

#

print(type(3.1))
print(type(5))
print(type("luka"))


















































